Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.6.144/include/proc/p32mk0512gpg048.h
extern volatile __ADCIMCON1bits_t ADCIMCON1bits __asm__ ("ADCIMCON1") __attribute__((section("sfrs"), address(0xBF887040)));
extern volatile uint32_t        ADCIMCON1CLR __attribute__((section("sfrs"),address(0xBF887044)));
extern volatile uint32_t        ADCIMCON1SET __attribute__((section("sfrs"),address(0xBF887048)));
extern volatile uint32_t        ADCIMCON1INV __attribute__((section("sfrs"),address(0xBF88704C)));
#define ADCIMCON2 ADCIMCON2
extern volatile uint32_t   ADCIMCON2 __attribute__((section("sfrs"), address(0xBF887050)));
typedef struct {
  uint32_t SIGN16:1;
  uint32_t DIFF16:1;
  uint32_t SIGN17:1;
  uint32_t DIFF17:1;
  uint32_t SIGN18:1;
  uint32_t DIFF18:1;
  uint32_t SIGN19:1;
  uint32_t DIFF19:1;
  uint32_t SIGN20:1;
  uint32_t DIFF20:1;
  uint32_t SIGN21:1;
  uint32_t DIFF21:1;
  uint32_t SIGN22:1;
  uint32_t DIFF22:1;
  uint32_t SIGN23:1;
  uint32_t DIFF23:1;
  uint32_t SIGN24:1;
  uint32_t DIFF24:1;
  uint32_t SIGN25:1;
  uint32_t DIFF25:1;
  uint32_t SIGN26:1;
  uint32_t DIFF26:1;
  uint32_t SIGN27:1;
  uint32_t DIFF27:1;
} __ADCIMCON2bits_t;
extern volatile __ADCIMCON2bits_t ADCIMCON2bits __asm__ ("ADCIMCON2") __attribute__((section("sfrs"), address(0xBF887050)));
extern volatile uint32_t        ADCIMCON2CLR __attribute__((section("sfrs"),address(0xBF887054)));
extern volatile uint32_t        ADCIMCON2SET __attribute__((section("sfrs"),address(0xBF887058)));
extern volatile uint32_t        ADCIMCON2INV __attribute__((section("sfrs"),address(0xBF88705C)));
#define ADCIMCON3 ADCIMCON3
extern volatile uint32_t   ADCIMCON3 __attribute__((section("sfrs"), address(0xBF887060)));
typedef struct {
  uint32_t :2;
  uint32_t SIGN33:1;
  uint32_t DIFF33:1;
  uint32_t SIGN34:1;
  uint32_t DIFF34:1;
  uint32_t SIGN35:1;
  uint32_t DIFF35:1;
  uint32_t SIGN36:1;
  uint32_t DIFF36:1;
  uint32_t SIGN37:1;
  uint32_t DIFF37:1;
  uint32_t SIGN38:1;
  uint32_t DIFF38:1;
  uint32_t SIGN39:1;
  uint32_t DIFF39:1;
  uint32_t SIGN40:1;
  uint32_t DIFF40:1;
  uint32_t SIGN41:1;
  uint32_t DIFF41:1;
  uint32_t :6;
  uint32_t SIGN45:1;
  uint32_t DIFF45:1;
  uint32_t SIGN46:1;
  uint32_t DIFF46:1;
  uint32_t SIGN47:1;
  uint32_t DIFF47:1;
} __ADCIMCON3bits_t;
extern volatile __ADCIMCON3bits_t ADCIMCON3bits __asm__ ("ADCIMCON3") __attribute__((section("sfrs"), address(0xBF887060)));
extern volatile uint32_t        ADCIMCON3CLR __attribute__((section("sfrs"),address(0xBF887064)));
extern volatile uint32_t        ADCIMCON3SET __attribute__((section("sfrs"),address(0xBF887068)));
extern volatile uint32_t        ADCIMCON3INV __attribute__((section("sfrs"),address(0xBF88706C)));
#define ADCIMCON4 ADCIMCON4
extern volatile uint32_t   ADCIMCON4 __attribute__((section("sfrs"), address(0xBF887070)));
typedef struct {
  uint32_t SIGN48:1;
  uint32_t DIFF48:1;
  uint32_t SIGN49:1;
  uint32_t DIFF49:1;
} __ADCIMCON4bits_t;
extern volatile __ADCIMCON4bits_t ADCIMCON4bits __asm__ ("ADCIMCON4") __attribute__((section("sfrs"), address(0xBF887070)));
extern volatile uint32_t        ADCIMCON4CLR __attribute__((section("sfrs"),address(0xBF887074)));
extern volatile uint32_t        ADCIMCON4SET __attribute__((section("sfrs"),address(0xBF887078)));
extern volatile uint32_t        ADCIMCON4INV __attribute__((section("sfrs"),address(0xBF88707C)));
#define ADCGIRQEN1 ADCGIRQEN1
extern volatile uint32_t   ADCGIRQEN1 __attribute__((section("sfrs"), address(0xBF887080)));
typedef struct {
  uint32_t AGIEN0:1;
  uint32_t AGIEN1:1;
  uint32_t AGIEN2:1;
  uint32_t AGIEN3:1;
  uint32_t AGIEN4:1;
  uint32_t AGIEN5:1;
  uint32_t AGIEN6:1;
  uint32_t AGIEN7:1;
  uint32_t AGIEN8:1;
  uint32_t AGIEN9:1;
  uint32_t AGIEN10:1;
  uint32_t AGIEN11:1;
  uint32_t AGIEN12:1;
  uint32_t AGIEN13:1;
  uint32_t AGIEN14:1;
  uint32_t AGIEN15:1;
  uint32_t AGIEN16:1;
  uint32_t AGIEN17:1;
  uint32_t AGIEN18:1;
  uint32_t AGIEN19:1;
  uint32_t AGIEN20:1;
  uint32_t AGIEN21:1;
  uint32_t AGIEN22:1;
  uint32_t AGIEN23:1;
  uint32_t AGIEN24:1;
  uint32_t AGIEN25:1;
  uint32_t AGIEN26:1;
  uint32_t AGIEN27:1;
} __ADCGIRQEN1bits_t;
extern volatile __ADCGIRQEN1bits_t ADCGIRQEN1bits __asm__ ("ADCGIRQEN1") __attribute__((section("sfrs"), address(0xBF887080)));
extern volatile uint32_t        ADCGIRQEN1CLR __attribute__((section("sfrs"),address(0xBF887084)));
extern volatile uint32_t        ADCGIRQEN1SET __attribute__((section("sfrs"),address(0xBF887088)));
extern volatile uint32_t        ADCGIRQEN1INV __attribute__((section("sfrs"),address(0xBF88708C)));
#define ADCGIRQEN2 ADCGIRQEN2
extern volatile uint32_t   ADCGIRQEN2 __attribute__((section("sfrs"), address(0xBF887090)));
typedef struct {
  uint32_t AGIEN32:1;
  uint32_t AGIEN33:1;
  uint32_t AGIEN34:1;
  uint32_t AGIEN35:1;
  uint32_t AGIEN36:1;
  uint32_t AGIEN37:1;
  uint32_t AGIEN38:1;
  uint32_t AGIEN39:1;
  uint32_t AGIEN40:1;
  uint32_t AGIEN41:1;
  uint32_t :3;
  uint32_t AGIEN45:1;
  uint32_t AGIEN46:1;
  uint32_t AGIEN47:1;
  uint32_t AGIEN48:1;
  uint32_t AGIEN49:1;
  uint32_t AGIEN50:1;
  uint32_t AGIEN51:1;
  uint32_t AGIEN52:1;
  uint32_t AGIEN53:1;
} __ADCGIRQEN2bits_t;
extern volatile __ADCGIRQEN2bits_t ADCGIRQEN2bits __asm__ ("ADCGIRQEN2") __attribute__((section("sfrs"), address(0xBF887090)));
extern volatile uint32_t        ADCGIRQEN2CLR __attribute__((section("sfrs"),address(0xBF887094)));
extern volatile uint32_t        ADCGIRQEN2SET __attribute__((section("sfrs"),address(0xBF887098)));
extern volatile uint32_t        ADCGIRQEN2INV __attribute__((section("sfrs"),address(0xBF88709C)));
#define ADCCSS1 ADCCSS1
extern volatile uint32_t   ADCCSS1 __attribute__((section("sfrs"), address(0xBF8870A0)));
typedef struct {
  uint32_t CSS0:1;
  uint32_t CSS1:1;
  uint32_t CSS2:1;
  uint32_t CSS3:1;
  uint32_t CSS4:1;
  uint32_t CSS5:1;
  uint32_t CSS6:1;
  uint32_t CSS7:1;
  uint32_t CSS8:1;
  uint32_t CSS9:1;
  uint32_t CSS10:1;
  uint32_t CSS11:1;
  uint32_t CSS12:1;
  uint32_t CSS13:1;
  uint32_t CSS14:1;
  uint32_t CSS15:1;
  uint32_t CSS16:1;
  uint32_t CSS17:1;
  uint32_t CSS18:1;
  uint32_t CSS19:1;
  uint32_t CSS20:1;
  uint32_t CSS21:1;
  uint32_t CSS22:1;
  uint32_t CSS23:1;
  uint32_t CSS24:1;
  uint32_t CSS25:1;
  uint32_t CSS26:1;
  uint32_t CSS27:1;
} __ADCCSS1bits_t;
extern volatile __ADCCSS1bits_t ADCCSS1bits __asm__ ("ADCCSS1") __attribute__((section("sfrs"), address(0xBF8870A0)));
extern volatile uint32_t        ADCCSS1CLR __attribute__((section("sfrs"),address(0xBF8870A4)));
extern volatile uint32_t        ADCCSS1SET __attribute__((section("sfrs"),address(0xBF8870A8)));
extern volatile uint32_t        ADCCSS1INV __attribute__((section("sfrs"),address(0xBF8870AC)));
#define ADCCSS2 ADCCSS2
extern volatile uint32_t   ADCCSS2 __attribute__((section("sfrs"), address(0xBF8870B0)));
typedef struct {
  uint32_t :1;
  uint32_t CSS33:1;
  uint32_t CSS34:1;
  uint32_t CSS35:1;
  uint32_t CSS36:1;
  uint32_t CSS37:1;
  uint32_t CSS38:1;
  uint32_t CSS39:1;
  uint32_t CSS40:1;
  uint32_t CSS41:1;
  uint32_t :3;
  uint32_t CSS45:1;
  uint32_t CSS46:1;
  uint32_t CSS47:1;
  uint32_t CSS48:1;
  uint32_t CSS49:1;
  uint32_t CSS50:1;
  uint32_t CSS51:1;
  uint32_t CSS52:1;
  uint32_t CSS53:1;
} __ADCCSS2bits_t;
extern volatile __ADCCSS2bits_t ADCCSS2bits __asm__ ("ADCCSS2") __attribute__((section("sfrs"), address(0xBF8870B0)));
extern volatile uint32_t        ADCCSS2CLR __attribute__((section("sfrs"),address(0xBF8870B4)));
extern volatile uint32_t        ADCCSS2SET __attribute__((section("sfrs"),address(0xBF8870B8)));
extern volatile uint32_t        ADCCSS2INV __attribute__((section("sfrs"),address(0xBF8870BC)));
#define ADCDSTAT1 ADCDSTAT1
extern volatile uint32_t   ADCDSTAT1 __attribute__((section("sfrs"), address(0xBF8870C0)));
typedef struct {
  uint32_t ARDY0:1;
  uint32_t ARDY1:1;
  uint32_t ARDY2:1;
  uint32_t ARDY3:1;
  uint32_t ARDY4:1;
  uint32_t ARDY5:1;
  uint32_t ARDY6:1;
  uint32_t ARDY7:1;
  uint32_t ARDY8:1;
  uint32_t ARDY9:1;
  uint32_t ARDY10:1;
  uint32_t ARDY11:1;
  uint32_t ARDY12:1;
  uint32_t ARDY13:1;
  uint32_t ARDY14:1;
  uint32_t ARDY15:1;
  uint32_t ARDY16:1;
  uint32_t ARDY17:1;
  uint32_t ARDY18:1;
  uint32_t ARDY19:1;
  uint32_t ARDY20:1;
  uint32_t ARDY21:1;
  uint32_t ARDY22:1;
  uint32_t ARDY23:1;
  uint32_t ARDY24:1;
  uint32_t ARDY25:1;
  uint32_t ARDY26:1;
  uint32_t ARDY27:1;
} __ADCDSTAT1bits_t;
extern volatile __ADCDSTAT1bits_t ADCDSTAT1bits __asm__ ("ADCDSTAT1") __attribute__((section("sfrs"), address(0xBF8870C0)));
extern volatile uint32_t        ADCDSTAT1CLR __attribute__((section("sfrs"),address(0xBF8870C4)));
extern volatile uint32_t        ADCDSTAT1SET __attribute__((section("sfrs"),address(0xBF8870C8)));
extern volatile uint32_t        ADCDSTAT1INV __attribute__((section("sfrs"),address(0xBF8870CC)));
#define ADCDSTAT2 ADCDSTAT2
extern volatile uint32_t   ADCDSTAT2 __attribute__((section("sfrs"), address(0xBF8870D0)));
typedef struct {
  uint32_t :1;
  uint32_t ARDY33:1;
  uint32_t ARDY34:1;
  uint32_t ARDY35:1;
  uint32_t ARDY36:1;
  uint32_t ARDY37:1;
  uint32_t ARDY38:1;
  uint32_t ARDY39:1;
  uint32_t ARDY40:1;
  uint32_t ARDY41:1;
  uint32_t :3;
  uint32_t ARDY45:1;
  uint32_t ARDY46:1;
  uint32_t ARDY47:1;
  uint32_t ARDY48:1;
  uint32_t ARDY49:1;
  uint32_t ARDY50:1;
  uint32_t ARDY51:1;
  uint32_t ARDY52:1;
  uint32_t ARDY53:1;
} __ADCDSTAT2bits_t;
extern volatile __ADCDSTAT2bits_t ADCDSTAT2bits __asm__ ("ADCDSTAT2") __attribute__((section("sfrs"), address(0xBF8870D0)));
extern volatile uint32_t        ADCDSTAT2CLR __attribute__((section("sfrs"),address(0xBF8870D4)));
extern volatile uint32_t        ADCDSTAT2SET __attribute__((section("sfrs"),address(0xBF8870D8)));
extern volatile uint32_t        ADCDSTAT2INV __attribute__((section("sfrs"),address(0xBF8870DC)));
#define ADCCMPEN1 ADCCMPEN1
extern volatile uint32_t   ADCCMPEN1 __attribute__((section("sfrs"), address(0xBF8870E0)));
typedef struct {
  uint32_t CMPE0:1;
  uint32_t CMPE1:1;
  uint32_t CMPE2:1;
  uint32_t CMPE3:1;
  uint32_t CMPE4:1;
  uint32_t CMPE5:1;
  uint32_t CMPE6:1;
  uint32_t CMPE7:1;
  uint32_t CMPE8:1;
  uint32_t CMPE9:1;
  uint32_t CMPE10:1;
  uint32_t CMPE11:1;
  uint32_t CMPE12:1;
  uint32_t CMPE13:1;
  uint32_t CMPE14:1;
  uint32_t CMPE15:1;
  uint32_t CMPE16:1;
  uint32_t CMPE17:1;
  uint32_t CMPE18:1;
  uint32_t CMPE19:1;
  uint32_t CMPE20:1;
  uint32_t CMPE21:1;
  uint32_t CMPE22:1;
  uint32_t CMPE23:1;
  uint32_t CMPE24:1;
  uint32_t CMPE25:1;
  uint32_t CMPE26:1;
  uint32_t CMPE27:1;
} __ADCCMPEN1bits_t;
extern volatile __ADCCMPEN1bits_t ADCCMPEN1bits __asm__ ("ADCCMPEN1") __attribute__((section("sfrs"), address(0xBF8870E0)));
extern volatile uint32_t        ADCCMPEN1CLR __attribute__((section("sfrs"),address(0xBF8870E4)));
extern volatile uint32_t        ADCCMPEN1SET __attribute__((section("sfrs"),address(0xBF8870E8)));
extern volatile uint32_t        ADCCMPEN1INV __attribute__((section("sfrs"),address(0xBF8870EC)));
#define ADCCMP1 ADCCMP1
extern volatile uint32_t   ADCCMP1 __attribute__((section("sfrs"), address(0xBF8870F0)));
typedef struct {
  uint32_t DCMPLO:16;
  uint32_t DCMPHI:16;
} __ADCCMP1bits_t;
extern volatile __ADCCMP1bits_t ADCCMP1bits __asm__ ("ADCCMP1") __attribute__((section("sfrs"), address(0xBF8870F0)));
extern volatile uint32_t        ADCCMP1CLR __attribute__((section("sfrs"),address(0xBF8870F4)));
extern volatile uint32_t        ADCCMP1SET __attribute__((section("sfrs"),address(0xBF8870F8)));
extern volatile uint32_t        ADCCMP1INV __attribute__((section("sfrs"),address(0xBF8870FC)));
#define ADCCMPEN2 ADCCMPEN2
extern volatile uint32_t   ADCCMPEN2 __attribute__((section("sfrs"), address(0xBF887100)));
typedef struct {
  uint32_t CMPE0:1;
  uint32_t CMPE1:1;
  uint32_t CMPE2:1;
  uint32_t CMPE3:1;
  uint32_t CMPE4:1;
  uint32_t CMPE5:1;
  uint32_t CMPE6:1;
  uint32_t CMPE7:1;
  uint32_t CMPE8:1;
  uint32_t CMPE9:1;
  uint32_t CMPE10:1;
  uint32_t CMPE11:1;
  uint32_t CMPE12:1;
  uint32_t CMPE13:1;
  uint32_t CMPE14:1;
  uint32_t CMPE15:1;
  uint32_t CMPE16:1;
  uint32_t CMPE17:1;
  uint32_t CMPE18:1;
  uint32_t CMPE19:1;
  uint32_t CMPE20:1;
  uint32_t CMPE21:1;
  uint32_t CMPE22:1;
  uint32_t CMPE23:1;
  uint32_t CMPE24:1;
  uint32_t CMPE25:1;
  uint32_t CMPE26:1;
  uint32_t CMPE27:1;
} __ADCCMPEN2bits_t;
extern volatile __ADCCMPEN2bits_t ADCCMPEN2bits __asm__ ("ADCCMPEN2") __attribute__((section("sfrs"), address(0xBF887100)));
extern volatile uint32_t        ADCCMPEN2CLR __attribute__((section("sfrs"),address(0xBF887104)));
extern volatile uint32_t        ADCCMPEN2SET __attribute__((section("sfrs"),address(0xBF887108)));
extern volatile uint32_t        ADCCMPEN2INV __attribute__((section("sfrs"),address(0xBF88710C)));
#define ADCCMP2 ADCCMP2
extern volatile uint32_t   ADCCMP2 __attribute__((section("sfrs"), address(0xBF887110)));
typedef struct {
  uint32_t DCMPLO:16;
  uint32_t DCMPHI:16;
} __ADCCMP2bits_t;
