Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.6.144/include/proc/p32mk0512gpg048.h
#define _SCK6R_SCK6R_POSITION                    0x00000000
#define _SCK6R_SCK6R_MASK                        0x0000000F
#define _SCK6R_SCK6R_LENGTH                      0x00000004

#define _SDI6R_SDI6R_POSITION                    0x00000000
#define _SDI6R_SDI6R_MASK                        0x0000000F
#define _SDI6R_SDI6R_LENGTH                      0x00000004

#define _SS6R_SS6R_POSITION                      0x00000000
#define _SS6R_SS6R_MASK                          0x0000000F
#define _SS6R_SS6R_LENGTH                        0x00000004

#define _C3RXR_C3RXR_POSITION                    0x00000000
#define _C3RXR_C3RXR_MASK                        0x0000000F
#define _C3RXR_C3RXR_LENGTH                      0x00000004

#define _C4RXR_C4RXR_POSITION                    0x00000000
#define _C4RXR_C4RXR_MASK                        0x0000000F
#define _C4RXR_C4RXR_LENGTH                      0x00000004

#define _QEA3R_QEA3R_POSITION                    0x00000000
#define _QEA3R_QEA3R_MASK                        0x0000000F
#define _QEA3R_QEA3R_LENGTH                      0x00000004

#define _QEB3R_QEB3R_POSITION                    0x00000000
#define _QEB3R_QEB3R_MASK                        0x0000000F
#define _QEB3R_QEB3R_LENGTH                      0x00000004

#define _INDX3R_INDX3R_POSITION                  0x00000000
#define _INDX3R_INDX3R_MASK                      0x0000000F
#define _INDX3R_INDX3R_LENGTH                    0x00000004

#define _HOME3R_HOME3R_POSITION                  0x00000000
#define _HOME3R_HOME3R_MASK                      0x0000000F
#define _HOME3R_HOME3R_LENGTH                    0x00000004

#define _QEA4R_QEA4R_POSITION                    0x00000000
#define _QEA4R_QEA4R_MASK                        0x0000000F
#define _QEA4R_QEA4R_LENGTH                      0x00000004

#define _QEB4R_QEB4R_POSITION                    0x00000000
#define _QEB4R_QEB4R_MASK                        0x0000000F
#define _QEB4R_QEB4R_LENGTH                      0x00000004

#define _INDX4R_INDX4R_POSITION                  0x00000000
#define _INDX4R_INDX4R_MASK                      0x0000000F
#define _INDX4R_INDX4R_LENGTH                    0x00000004

#define _HOME4R_HOME4R_POSITION                  0x00000000
#define _HOME4R_HOME4R_MASK                      0x0000000F
#define _HOME4R_HOME4R_LENGTH                    0x00000004

#define _QEA5R_QEA5R_POSITION                    0x00000000
#define _QEA5R_QEA5R_MASK                        0x0000000F
#define _QEA5R_QEA5R_LENGTH                      0x00000004

#define _QEB5R_QEB5R_POSITION                    0x00000000
#define _QEB5R_QEB5R_MASK                        0x0000000F
#define _QEB5R_QEB5R_LENGTH                      0x00000004

#define _INDX5R_INDX5R_POSITION                  0x00000000
#define _INDX5R_INDX5R_MASK                      0x0000000F
#define _INDX5R_INDX5R_LENGTH                    0x00000004

#define _HOME5R_HOME5R_POSITION                  0x00000000
#define _HOME5R_HOME5R_MASK                      0x0000000F
#define _HOME5R_HOME5R_LENGTH                    0x00000004

#define _QEA6R_QEA6R_POSITION                    0x00000000
#define _QEA6R_QEA6R_MASK                        0x0000000F
#define _QEA6R_QEA6R_LENGTH                      0x00000004

#define _QEB6R_QEB6R_POSITION                    0x00000000
#define _QEB6R_QEB6R_MASK                        0x0000000F
#define _QEB6R_QEB6R_LENGTH                      0x00000004

#define _INDX6R_INDX6R_POSITION                  0x00000000
#define _INDX6R_INDX6R_MASK                      0x0000000F
#define _INDX6R_INDX6R_LENGTH                    0x00000004

#define _HOME6R_HOME6R_POSITION                  0x00000000
#define _HOME6R_HOME6R_MASK                      0x0000000F
#define _HOME6R_HOME6R_LENGTH                    0x00000004

#define _CLCINAR_CLCINAR_POSITION                0x00000000
#define _CLCINAR_CLCINAR_MASK                    0x0000000F
#define _CLCINAR_CLCINAR_LENGTH                  0x00000004

#define _CLCINBR_CLCINBR_POSITION                0x00000000
#define _CLCINBR_CLCINBR_MASK                    0x0000000F
#define _CLCINBR_CLCINBR_LENGTH                  0x00000004

#define _CLCINCR_CLCINCR_POSITION                0x00000000
#define _CLCINCR_CLCINCR_MASK                    0x0000000F
#define _CLCINCR_CLCINCR_LENGTH                  0x00000004

#define _CLCINDR_CLCINDR_POSITION                0x00000000
#define _CLCINDR_CLCINDR_MASK                    0x0000000F
#define _CLCINDR_CLCINDR_LENGTH                  0x00000004

#define _RPA0R_RPA0R_POSITION                    0x00000000
#define _RPA0R_RPA0R_MASK                        0x0000001F
#define _RPA0R_RPA0R_LENGTH                      0x00000005

#define _RPA1R_RPA1R_POSITION                    0x00000000
#define _RPA1R_RPA1R_MASK                        0x0000001F
#define _RPA1R_RPA1R_LENGTH                      0x00000005

#define _RPA2R_RPA2R_POSITION                    0x00000000
#define _RPA2R_RPA2R_MASK                        0x0000001F
#define _RPA2R_RPA2R_LENGTH                      0x00000005

#define _RPA3R_RPA3R_POSITION                    0x00000000
#define _RPA3R_RPA3R_MASK                        0x0000001F
#define _RPA3R_RPA3R_LENGTH                      0x00000005

#define _RPA4R_RPA4R_POSITION                    0x00000000
#define _RPA4R_RPA4R_MASK                        0x0000001F
#define _RPA4R_RPA4R_LENGTH                      0x00000005

#define _RPA7R_RPA7R_POSITION                    0x00000000
#define _RPA7R_RPA7R_MASK                        0x0000001F
#define _RPA7R_RPA7R_LENGTH                      0x00000005

#define _RPA8R_RPA8R_POSITION                    0x00000000
#define _RPA8R_RPA8R_MASK                        0x0000001F
#define _RPA8R_RPA8R_LENGTH                      0x00000005

#define _RPA11R_RPA11R_POSITION                  0x00000000
#define _RPA11R_RPA11R_MASK                      0x0000001F
#define _RPA11R_RPA11R_LENGTH                    0x00000005

#define _RPA12R_RPA12R_POSITION                  0x00000000
#define _RPA12R_RPA12R_MASK                      0x0000001F
#define _RPA12R_RPA12R_LENGTH                    0x00000005

#define _RPA14R_RPA14R_POSITION                  0x00000000
#define _RPA14R_RPA14R_MASK                      0x0000001F
#define _RPA14R_RPA14R_LENGTH                    0x00000005

#define _RPA15R_RPA15R_POSITION                  0x00000000
#define _RPA15R_RPA15R_MASK                      0x0000001F
#define _RPA15R_RPA15R_LENGTH                    0x00000005

#define _RPB0R_RPB0R_POSITION                    0x00000000
#define _RPB0R_RPB0R_MASK                        0x0000001F
#define _RPB0R_RPB0R_LENGTH                      0x00000005

#define _RPB1R_RPB1R_POSITION                    0x00000000
#define _RPB1R_RPB1R_MASK                        0x0000001F
#define _RPB1R_RPB1R_LENGTH                      0x00000005

#define _RPB2R_RPB2R_POSITION                    0x00000000
#define _RPB2R_RPB2R_MASK                        0x0000001F
#define _RPB2R_RPB2R_LENGTH                      0x00000005

#define _RPB3R_RPB3R_POSITION                    0x00000000
#define _RPB3R_RPB3R_MASK                        0x0000001F
#define _RPB3R_RPB3R_LENGTH                      0x00000005

